duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/screen/screen.c
void NotifyScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_NOTIFY].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATED;
				
		NotifyShow();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;

}

void SOSUpdateStatus(void)
{
	switch(sos_state)
	{
	case SOS_STATUS_IDLE:
		break;
		
	case SOS_STATUS_SENDING:
		break;
	
	case SOS_STATUS_SENT:
	#if 0	//xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT	
		AnimaStopShow();
	#endif
		LCD_Clear(BLACK);
		LCD_ShowImg(MSG_SENDING_X, MSG_SENDING_Y, IMG_SENDING_3);
		LCD_ShowImg(MSG_SEND_OK_X, MSG_SEND_OK_Y, IMG_SENDING_OK);
		sos_state = SOS_STATUS_RECEIVED;
		break;
	
	case SOS_STATUS_RECEIVED:
		break;
	
	case SOS_STATUS_CANCEL:
		break;
	}
}

void SOSShowStatus(void)
{
	unsigned char *img_anima[9] = {IMG_SENDING_1,IMG_SENDING_2,IMG_SENDING_3,
								   IMG_SENDING_1,IMG_SENDING_2,IMG_SENDING_3,
								   IMG_SENDING_1,IMG_SENDING_2,IMG_SENDING_3};
	unsigned char *img_icon[2] = {IMG_SOS_ICON,IMG_SENDING_OK};
	
	LCD_Clear(BLACK);

#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT
	AnimaShow(MSG_SENDING_X, MSG_SENDING_Y, img_anima, ARRAY_SIZE(img_anima), 500, false, SOSSChangrStatus);
#else
	LCD_ShowImg(MSG_SENDING_X, MSG_SENDING_Y, IMG_SENDING_3);
	SOSSChangrStatus();
#endif

	LCD_ShowImg(SOS_ICON_X, SOS_ICON_Y, img_icon[0]);
}

void SOSScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SOS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SOS].status = SCREEN_STATUS_CREATED;

		SOSShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SOS].para&SCREEN_EVENT_UPDATE_SOS)
		{
			scr_msg[SCREEN_ID_SOS].para &= (~SCREEN_EVENT_UPDATE_SOS);
			SOSUpdateStatus();
		}

		if(scr_msg[SCREEN_ID_SOS].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_NO;
		break;
	}
}

#ifdef CONFIG_SYNC_SUPPORT
void ExitSyncDataScreen(void)
{		
	SyncDataStop();
	
#ifdef CONFIG_FOTA_DOWNLOAD
	EnterFOTAScreen();
#else
	EnterPoweroffScreen();
#endif
}

void EnterSyncDataScreen(void)
{
	if(screen_id == SCREEN_ID_SYNC)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_SYNC;
	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_SYNC].status = SCREEN_STATUS_CREATING;

#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStopShow();
#endif
	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(3), K_NO_WAIT);

	SetLeftKeyUpHandler(ExitSyncDataScreen);
}

void SyncUpdateStatus(void)
{
	unsigned char *img_anima[4] = {IMG_SYNC_LINKING_ICON_1, IMG_SYNC_LINKING_ICON_2,IMG_SYNC_LINKING_ICON_3,IMG_SYNC_LINKING_ICON_4};
	
	switch(sync_state)
	{
	case SYNC_STATUS_IDLE:
		break;

	case SYNC_STATUS_LINKING:
		LCD_Fill(SYNC_TEXT_X, SYNC_TEXT_Y, SYNC_TEXT_W, SYNC_TEXT_W, BLACK);
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_LINKING_CN);
		else
			LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_LINKING_EN);
		
	#ifdef CONFIG_ANIMATION_SUPPORT
		AnimaShow(SYNC_ANIMA_X, SYNC_ANIMA_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
	#endif
		break;
		
	case SYNC_STATUS_SENT:
	#ifdef CONFIG_ANIMATION_SUPPORT 
		AnimaStopShow();
	#endif

		LCD_ShowImg(SYNC_ICON_X, SYNC_ICON_Y, IMG_SYNC_FINISH_ICON);
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_FINISH_CN);
		else
			LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_FINISH_EN);

		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
		
	case SYNC_STATUS_FAIL:
	#ifdef CONFIG_ANIMATION_SUPPORT 
		AnimaStopShow();
	#endif

		LCD_ShowImg(SYNC_ICON_X, SYNC_ICON_Y, IMG_SYNC_FAIL_ICON);
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_FAIL_CN);
		else
			LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_FAIL_EN);

		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
	}
}

void SyncShowStatus(void)
{
	unsigned char *img_anima[2] = {IMG_SYNC_ICON, IMG_SYNC_ICON};

	LCD_Clear(BLACK);

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaShow(SYNC_ICON_X, SYNC_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
#else
	LCD_ShowImg(SYNC_ICON_X, SYNC_ICON_Y, IMG_SYNC_ICON);
#endif

	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_CN);
	else
		LCD_ShowImg(SYNC_TEXT_X, SYNC_TEXT_Y, IMG_SYNC_EN);	
}

void SyncScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SYNC].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SYNC].status = SCREEN_STATUS_CREATED;

		SyncShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SYNC].para&SCREEN_EVENT_UPDATE_SYNC)
			scr_msg[SCREEN_ID_SYNC].para &= (~SCREEN_EVENT_UPDATE_SYNC);

		SyncUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_NO;
}
#endif/*CONFIG_SYNC_SUPPORT*/

#ifdef CONFIG_IMU_SUPPORT
void SleepUpdateStatus(void)
{
	uint16_t total_sleep,deep_sleep,light_sleep;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	
	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep+light_sleep;
	
	LCD_ShowImg(SLEEP_NUM_1_X, SLEEP_NUM_1_Y, img_num[(total_sleep/60)/10]);
	LCD_ShowImg(SLEEP_NUM_2_X, SLEEP_NUM_2_Y, img_num[(total_sleep/60)%10]);
	LCD_ShowImg(SLEEP_NUM_3_X, SLEEP_NUM_3_Y, img_num[(total_sleep%60)/10]);
	LCD_ShowImg(SLEEP_NUM_4_X, SLEEP_NUM_4_Y, img_num[(total_sleep%60)%10]);
}

void SleepShowStatus(void)
{
	uint16_t total_sleep,deep_sleep,light_sleep;
	unsigned char *img_anima[4] = {IMG_SLEEP_ICON_1,IMG_SLEEP_ICON_2,IMG_SLEEP_ICON_3,IMG_SLEEP_ICON_4};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_uint_hr[2] = {IMG_SLEEP_HR_CN, IMG_SLEEP_HR_EN};
	unsigned char *img_uint_min[2] = {IMG_SLEEP_MIN_CN, IMG_SLEEP_MIN_EN};
	
