duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/screen/screen.c
	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep+light_sleep;
	
	LCD_Clear(BLACK);

#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT
	AnimaShow(SLEEP_ICON_X, SLEEP_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
#else
	LCD_ShowImg(SLEEP_ICON_X, SLEEP_ICON_Y, IMG_SLEEP_ICON_4);
#endif

	LCD_ShowImg(SLEEP_NUM_1_X, SLEEP_NUM_1_Y, img_num[(total_sleep/60)/10]);
	LCD_ShowImg(SLEEP_NUM_2_X, SLEEP_NUM_2_Y, img_num[(total_sleep/60)%10]);
	LCD_ShowImg(SLEEP_NUM_3_X, SLEEP_NUM_3_Y, img_num[(total_sleep%60)/10]);
	LCD_ShowImg(SLEEP_NUM_4_X, SLEEP_NUM_4_Y, img_num[(total_sleep%60)%10]);

	if(global_settings.language == LANGUAGE_CHN)
	{
		LCD_ShowImg(SLEEP_HOUR_X, SLEEP_HOUR_Y, img_uint_hr[0]);
		LCD_ShowImg(SLEEP_MIN_X, SLEEP_MIN_Y, img_uint_min[0]);
	}
	else
	{
		LCD_ShowImg(SLEEP_HOUR_X, SLEEP_HOUR_Y, img_uint_hr[1]);
		LCD_ShowImg(SLEEP_MIN_X, SLEEP_MIN_Y, img_uint_min[1]);
	}
}

void SleepScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SLEEP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SLEEP].status = SCREEN_STATUS_CREATED;

		SleepShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		SleepUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
}

void StepsUpdateStatus(void)
{
	uint16_t steps;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	
	GetSportData(&steps,NULL,NULL);

	LCD_ShowImg(STEPS_NUM_1_X, STEPS_NUM_1_Y, img_num[steps/10000]);
	LCD_ShowImg(STEPS_NUM_2_X, STEPS_NUM_2_Y, img_num[(steps%10000)/1000]);
	LCD_ShowImg(STEPS_NUM_3_X, STEPS_NUM_3_Y, img_num[(steps%1000)/100]);
	LCD_ShowImg(STEPS_NUM_4_X, STEPS_NUM_4_Y, img_num[(steps%100)/10]);
	LCD_ShowImg(STEPS_NUM_5_X, STEPS_NUM_5_Y, img_num[steps%10]);	
}

void StepsShowStatus(void)
{
	uint16_t steps;
	unsigned char *img_anima[2] = {IMG_STEP_ICON_1, IMG_STEP_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_uint[2] = {IMG_STEP_CN, IMG_STEP_EN};
	
	GetSportData(&steps,NULL,NULL);

	LCD_Clear(BLACK);

#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT
	AnimaShow(STEPS_ICON_X, STEPS_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
#else
	LCD_ShowImg(STEPS_ICON_X, STEPS_ICON_Y, IMG_STEP_ICON_1);
#endif

	LCD_ShowImg(STEPS_NUM_1_X, STEPS_NUM_1_Y, img_num[steps/10000]);
	LCD_ShowImg(STEPS_NUM_2_X, STEPS_NUM_2_Y, img_num[(steps%10000)/1000]);
	LCD_ShowImg(STEPS_NUM_3_X, STEPS_NUM_3_Y, img_num[(steps%1000)/100]);
	LCD_ShowImg(STEPS_NUM_4_X, STEPS_NUM_4_Y, img_num[(steps%100)/10]);
	LCD_ShowImg(STEPS_NUM_5_X, STEPS_NUM_5_Y, img_num[steps%10]);

	//if(global_settings.language == LANGUAGE_CHN)
	//	LCD_ShowImg(STEPS_UNIT_X+offset_x, STEPS_UNIT_Y, img_uint[0]);
	//else
	//	LCD_ShowImg(STEPS_UNIT_X, STEPS_UNIT_Y, img_uint[1]);	
}

void StepsScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_STEPS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATED;

		StepsShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_STEPS].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_STEPS].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		StepsUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
}

void DistanceUpdateStatus(void)
{
	uint16_t distance;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSportData(NULL,NULL,&distance);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%100)/10]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%10]);
}

void DistanceShowStatus(void)
{
	uint16_t distance;
	unsigned char *img_anima[2] = {IMG_DISTANCE_ICON_1, IMG_DISTANCE_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_km[2] = {IMG_KM_CN, IMG_KM_EN};
	
	GetSportData(NULL,NULL,&distance);

	LCD_Clear(BLACK);

#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT	
	AnimaShow(DIS_ICON_X, DIS_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
#else
	LCD_ShowImg(DIS_ICON_X, DIS_ICON_Y, IMG_DISTANCE_ICON_1);
#endif

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%100)/10]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%10]);
	
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(DIS_KM_X, DIS_KM_Y, img_km[0]);
	else
		LCD_ShowImg(DIS_KM_X, DIS_KM_Y, img_km[1]);
}

void DistanceScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_DISTANCE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_DISTANCE].status = SCREEN_STATUS_CREATED;

		DistanceShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_DISTANCE].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_DISTANCE].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		DistanceUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_DISTANCE].act = SCREEN_ACTION_NO;
}

void CalorieUpdateStatus(void)
{
	uint16_t distance;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSportData(NULL,NULL,&distance);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%1000)/100]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%100]);
}

