duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/screen/screen.c
void CalorieShowStatus(void)
{
	uint16_t calorie;
	unsigned char *img_anima[2] = {IMG_CAL_ICON_1, IMG_CAL_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_cal[2] = {IMG_CAL_CN, IMG_CAL_EN};
	
	GetSportData(NULL,&calorie,NULL);

	LCD_Clear(BLACK);

#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT	
	AnimaShow(CAL_ICON_X, CAL_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
#else
	LCD_ShowImg(CAL_ICON_X, CAL_ICON_Y, IMG_CAL_ICON_1);
#endif

	LCD_ShowImg(CAL_NUM_1_X, CAL_NUM_1_Y, img_num[calorie/1000]);
	LCD_ShowImg(CAL_NUM_2_X, CAL_NUM_2_Y, img_num[(calorie%1000)/100]);
	LCD_ShowImg(CAL_NUM_3_X, CAL_NUM_3_Y, img_num[(calorie%100)/10]);
	LCD_ShowImg(CAL_NUM_4_X, CAL_NUM_4_Y, img_num[calorie%10]);
	
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img_cal[0]);
	else
		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img_cal[1]);
}

void CalorieScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_CALORIE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_CALORIE].status = SCREEN_STATUS_CREATED;

		CalorieShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_CALORIE].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_CALORIE].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		CalorieUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_CALORIE].act = SCREEN_ACTION_NO;
}

void FallUpdateStatus(void)
{
	unsigned char *img_anima_send[3] = {IMG_SENDING_1, IMG_SENDING_2, IMG_SENDING_3};
	unsigned char *img_fall[2] = {IMG_FALL_CN, IMG_FALL_EN};
	unsigned char *img_cancel[2] = {IMG_FALL_MSG_CANCEL_CN, IMG_FALL_MSG_CANCEL_EN};

	LCD_Clear(BLACK);
	
	switch(fall_state)
	{
	case FALL_STATUS_IDLE:
		break;
		
	case FALL_STATUS_NOTIFY:
		break;
	
	case FALL_STATUS_SENDING:
	#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT	
		AnimaShow(MSG_SENDING_X, MSG_SENDING_Y, img_anima_send, ARRAY_SIZE(img_anima_send), 500, true, NULL);
	#else
		LCD_ShowImg(MSG_SENDING_X, MSG_SENDING_Y, IMG_SENDING_3);
	#endif
	
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[0]);
		else
			LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[1]);	
		break;
		
	case FALL_STATUS_SENT:
	#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT	
		AnimaStopShow();
	#endif
		LCD_Clear(BLACK);
		LCD_ShowImg(MSG_SENDING_X, MSG_SENDING_Y, IMG_SENDING_3);
		LCD_ShowImg(MSG_SEND_OK_X, MSG_SEND_OK_Y, IMG_SENDING_OK);
		break;
		
	case FALL_STATUS_CANCEL:
	#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT
		AnimaStopShow();
	#endif
		LCD_Clear(BLACK);
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(FALL_CANCEL_CN_X, FALL_CANCEL_CN_Y, img_cancel[0]);
		else
			LCD_ShowImg(FALL_CANCEL_EN_X, FALL_CANCEL_EN_Y, img_cancel[1]);	
		break;

	case FALL_STATUS_CANCELED:
		break;
	}
}

void FallShowStatus(void)
{
	unsigned char *img_anima[3] = {IMG_FALL_ICON_1, IMG_FALL_ICON_2,IMG_FALL_ICON_3};
	unsigned char *img_fall[2] = {IMG_FALL_CN, IMG_FALL_EN};

	LCD_Clear(BLACK);

#if 0 //xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT
	AnimaShow(FALL_ICON_X, FALL_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);
#else
	LCD_ShowImg(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON_3);
#endif

	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[0]);
	else
		LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[1]);
}

void FallScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FALL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATED;

		FallShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		FallUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
}
#endif

void WristShowStatus(void)
{
//	unsigned char *img[2] = {IMG_WRIST_OFF_CN, IMG_WRIST_OFF_EN};

//	if(global_settings.language == LANGUAGE_CHN)
//		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img[0]);
//	else
//		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img[1]);
}

void WristScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_WRIST].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_WRIST].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_WRIST].status = SCREEN_STATUS_CREATED;

		WristShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_WRIST].act = SCREEN_ACTION_NO;
}

#ifdef CONFIG_FOTA_DOWNLOAD
void FOTAShowStatus(void)
{
	LCD_Clear(BLACK);
	LCD_ShowImg(FOTA_ICON_X, FOTA_ICON_Y, IMG_FOTA_ICON);

	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(FOTA_TEXT_X, FOTA_TEXT_Y, IMG_FOTA_CN);
	else
		LCD_ShowImg(FOTA_TEXT_X, FOTA_TEXT_Y, IMG_FOTA_EN); 
}

void FOTAUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;
	unsigned char *img_num[10] = {IMG_DATE_NUM_0,IMG_DATE_NUM_1,IMG_DATE_NUM_2,IMG_DATE_NUM_3,IMG_DATE_NUM_4,
									IMG_DATE_NUM_5,IMG_DATE_NUM_6,IMG_DATE_NUM_7,IMG_DATE_NUM_8,IMG_DATE_NUM_9};
	
	switch(get_fota_status())
	{
	case FOTA_STATUS_PREPARE:
		flag = false;
		break;
		
	case FOTA_STATUS_LINKING:
		LCD_Clear(BLACK);
		LCD_ShowImg(FOTA_ICON_X, FOTA_ICON_Y, IMG_FOTA_LINK_ICON);
		
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(FOTA_TEXT_X, FOTA_TEXT_Y, IMG_FOTA_LINKING_CN);
		else
			LCD_ShowImg(FOTA_TEXT_X, FOTA_TEXT_Y, IMG_FOTA_LINKING_EN); 

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_DOWNLOADING:
		if(!flag)
		{
			flag = true;

			LCD_Clear(BLACK);
			
			if(global_settings.language == LANGUAGE_CHN)
				LCD_ShowImg(FOTA_DOWNLOADING_TEXT_X, FOTA_DOWNLOADING_TEXT_Y, IMG_FOTA_DOWNLOADING_CN);
			else
				LCD_ShowImg(FOTA_DOWNLOADING_TEXT_X, FOTA_DOWNLOADING_TEXT_Y, IMG_FOTA_DOWNLOADING_EN); 

			LCD_DrawRectangle(FOTA_DOWNLOADING_PRO_X, FOTA_DOWNLOADING_PRO_Y, FOTA_DOWNLOADING_PRO_W, FOTA_DOWNLOADING_PRO_H);

			x = (LCD_WIDTH - FOTA_DOWNLOADING_NUM_W - FOTA_DOWNLOADING_PERCENT_W)/2;
			LCD_ShowImg(x, FOTA_DOWNLOADING_PERCENT_Y, IMG_DATE_NUM_0); 
			LCD_ShowImg(x+FOTA_DOWNLOADING_NUM_W, FOTA_DOWNLOADING_PERCENT_Y, IMG_FOTA_PERCENT); 
		}
		else
		{
			pro_len = (g_fota_progress*FOTA_DOWNLOADING_PRO_W)/100;
			LCD_Fill(FOTA_DOWNLOADING_PRO_X, FOTA_DOWNLOADING_PRO_Y, pro_len, FOTA_DOWNLOADING_PRO_H, WHITE);

			x = (LCD_WIDTH - 2*FOTA_DOWNLOADING_NUM_W - FOTA_DOWNLOADING_PERCENT_W)/2;
			LCD_ShowImg(x, FOTA_DOWNLOADING_PERCENT_Y, img_num[g_fota_progress/10]);
			LCD_ShowImg(x+FOTA_DOWNLOADING_NUM_W, FOTA_DOWNLOADING_PERCENT_Y, img_num[g_fota_progress%10]);
			LCD_ShowImg(x+2*FOTA_DOWNLOADING_NUM_W, FOTA_DOWNLOADING_PERCENT_Y, IMG_FOTA_PERCENT); 
		}

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_FINISHED:
		flag = false;

		LCD_Clear(BLACK);
		LCD_ShowImg(FOTA_ICON_X, FOTA_ICON_Y, IMG_FOTA_ICON);
		
